## Aula 3 - Pandas e Fontes de dados

### Manipulação de Fontes de Dados

In [ ]:
#Fazer o download dos datasets
!git clone https://github.com/alexlopespereira/curso_ciencia_dados2020.git ~/work/curso_ciencia_dados2020

In [4]:
import pandas as pd
import numpy as np

#### Carregar dados de um Arquivo XLS

In [1]:
### Ler o arquivo com o pib dos municípios brasileiros e guarde numa variável df_pib


# sheet_name é o argumento para o aba da planilha desejada. 
# Se você quiser a 1a aba, não precisa especificar.
# .. significa o diretorio pai do diretorio atual. Se quiser saber o diretorio atual
# use o seguinte código
import os
print(os.getcwd())

C:\Users\alex\Google Drive\Aulas\Enap\BootcampTI2020\Modulo2\AnaliseDeDados_Teste1\Aulas\notebook\Aula3

In [4]:
# Mostra os primeiros 4 registros da variavel df_pib
df_pib.head(4)
### As 3 primeiras e a ultima linha são inuteis

,"Tabela 5938 - Produto interno bruto a preços correntes, impostos, líquidos de subsídios, sobre produtos a preços correntes e valor adicionado bruto a preços correntes total e por atividade econômica, e respectivas participações - Referência 2010",Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8
0,Variável - Produto Interno Bruto a preços corr...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Nível,Cód.,Município,Ano,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,2007,2009,2011,2013.0,2015.0,2017.0
3,MU,1100015,Alta Floresta D'Oeste (RO),191364,256986,280510,341325.0,421300.0,498864.0

In [7]:
# Mostra os ultimos 4 registros da variavel df_pib
df_pib.tail(4)

,"Tabela 5938 - Produto interno bruto a preços correntes, impostos, líquidos de subsídios, sobre produtos a preços correntes e valor adicionado bruto a preços correntes total e por atividade econômica, e respectivas participações - Referência 2010",Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8
5570,MU,5222203,Vila Boa (GO),31897,73367,84103,103233.0,111229.0,137500.0
5571,MU,5222302,Vila Propício (GO),76868,107125,112821,142970.0,198935.0,182175.0
5572,MU,5300108,Brasília (DF),93404001,124323753,154568954,175906726.0,215612863.0,244682756.0
5573,"Fonte: IBGE, em parceria com os &Oacute;rg&ati...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [6]:
# Ler o arquivo do pib removendo as 3 primeiras linhas e a última


# Mostra os primeiros registros
df_pib.head()
# O nome das 3 primeiras colunas está incoerente

In [7]:
# Renomear estas colunas


# Mostra os primeiros registros
df_pib.head()

#### Carregar dados de um Arquivo CSV

In [31]:
# Salvar este dataframe em formato CSV
# O separador padrão é vírgula. Use o ; para testar a especificação de um separador
# Recomendação para nomes de arquivos: use nomes simples, sem espaço e sem caracteres especiais.


# Para mostrar as primeiras linhas do arquivo no Linux: !head ../data/pib_municipios.csv

In [8]:
# Carregue o arquivo pib_municipios.csv. Atente para o separador correto.


# Mostra os primeiros registros
df_pib_csv.head()

#### Carregar dados de uma API REST e Arquivo JSON

In [8]:
# Ler um arquivo JSON de uma URL para um dataframe df_dolar. 
# Pode-se carregar de uma pasta local também.

In [9]:
# Mostra os primeiros registros deste dataframe df_dolar
df_dolar.head()

    base       date  time_last_updated      rates
AED  USD 2020-08-02         1596326641   3.672004
ARS  USD 2020-08-02         1596326641  72.265326
AUD  USD 2020-08-02         1596326641   1.394425
BGN  USD 2020-08-02         1596326641   1.650305
BRL  USD 2020-08-02         1596326641   5.170368

In [9]:
# Teste a conversão para DataFrame a partir de um JSON mais complexo 
# Carregue o dataframe retornado pela chamada 
#   GET à URL "https://www.servicos.gov.br/api/v1/servicos/9029"


# Mostra os primeiros registros
df_servicos.head()
# O resultado não foi como esperado

#### A função read_json não conseguiu processar e criar o DataFrame esperado a partir do JSON
#### A solução alternativa é selecionar os atributos do JSON e colocar num dicionário para construir um DataFrame

In [11]:
import requests # Biblioteca que realiza requisições HTTP em python

def get_servicos(siorg):
    '''Retorna os dados da API de serviços para o órgao especificado pelo argumento siorg
    '''
    url = 'https://servicos.gov.br/api/v1/servicos/orgao/{0}'.format(siorg)
    response = requests.get(url) # Realiza uma requisição http
    input_json = response.json()
    if not input_json or 'resposta' not in input_json:
        print("Os dados da api de servicos nao estao disponiveis")
        return {}
    input_json = input_json['resposta']
    result = []
    for i in input_json: # iteração para cada serviço do órgão
        servico_id = i['id'].split('/')[6]
        servico_nome = i['nome']
        servico_url = i['url'][36:]
        orgao_id = i['orgao']['id'].split('/')[5]
        orgao_dbId = i['orgao']['dbId']
        orgao_nome = i['orgao']['nomeOrgao']
        result.append({'servico_id': servico_id, 'servico_nome': servico_nome, 'servico_url': servico_url, 'orgao_nome': orgao_nome,
                              'orgao_id': orgao_id, 'orgao_dbId': orgao_dbId})
    return result

In [12]:
# Testa o método com o sirgo da Fio Cruz
d = get_servicos(315) 
# Transforma a lista de dicionários num DataFrame

# Mostra os primeiros registros
df_servicos.head()

#### Carregar dados de Arquivo HTML (Web Scrapy)

In [13]:
# Ler um arquivo HTML (https://en.wikipedia.org/wiki/Pythonidae) 
#   carregando as tabelas presentes (Web Scrapy)


# Mostra os primeiros registros da tabela 2 da página analisada
df_python[2].head()

In [14]:
# Renomear as colunas do dataframe retirando colchetes e espaço, usando
#     um mapeamento 'antes':'depois' no formato de um dicionário.
# Use inplace=True


# Mostra os primeiros registros da tabela 2
df_python[2].head()

#### Dados em Bancos de Dados

##### Converter um dataframe para uma tabela de banco de dados

In [15]:
# O banco de dados SQLite é um banco bem simples gerenciado em um único arquivo. 
# É usado, por exemplo, em aplicativos de celular.
# A biblioteca sqlalchemy é um mapeamento objeto-relacional para vários SGBDs.
# Esta biblioteca consegue executar comandos SQL em todos os SGBDs compatíveis.
import sqlalchemy as sqla

# Crie uma conexão com o banco de dados
con = sqla.create_engine('sqlite:///../data/curso_cd.sqlite')

# Escreva o DataFrame df_python[2] numa tabela de um banco de dados SQLite
df_python[2].to_sql("python", con, if_exists="replace")

#### Você pode visualizar seu banco de dados de forma independente 
#### em https://inloop.github.io/sqlite-viewer/

##### Carregar os dados de uma tabela de banco de dados para um DataFrame

In [15]:
# Execute uma query SELECT no banco de dados sqlite convertendo toda a tabela python num DataFrame
# ajustando o parametro index_col='index'

# Visualize os primeiros registros
df_sqlite.head()

##### Fazer cálculos envolvendo agregação

In [16]:
# Calcular a soma quantidade de subespecies de cada especie


# Mostra os primeiros registros da agregação
df_sqlite_agg.head()

In [17]:
# Calcular a quantidade de subspecies de cada região geográfica e ordenar pela 
# quantidade de subspecies de forma decrescente


# Mostra os primeiros 10 registros da agregação
df_sqlite_agg2.head(10)

# Fecha a conexão com o banco de dados
con.close()

### Outras Operacoes no Pandas

#### Descartando valores faltantes (NA ou NaN)

In [20]:
from numpy import nan as NA
# Considere a serie a seguir
data = pd.Series([1, NA, 3.5, NA, 7])
# Remova os valores NA

In [19]:
# Comando equivalente ao dropna, mas usando o método notnull()

#### Preenchendo valores faltantes

In [18]:
# Considere o seguinte DataFrame
# Construir um dataframe a partir de uma matriz de 7 x 3 de números aleatórios 
# de uma distribuição normal padrão
df = pd.DataFrame(np.random.randn(7, 3)) 
# Preencha o DataFrame com alguns valores NA

In [21]:
# Preencha os valores NA com zero

In [23]:
# Use um mapeamento (com dicionário) para preencher os valores NA
# Na coluna 1 substitua NA por 0.5 e na coluna 2 substitua NA por 0

In [24]:
# Preencha com zero alterando o DataFrame df

In [41]:
# Considere o seguinte dataframe
df = pd.DataFrame(np.random.randn(7, 3)) 
# Preencha o DataFrame com alguns valores NA
df.iloc[1:4, 1] = NA
df.iloc[1:3, 2] = NA
df

          0         1         2
0  0.066200  1.296986 -0.049398
1 -1.926564       NaN       NaN
2  1.010706       NaN       NaN
3 -0.595972       NaN  0.113433
4  0.131007 -0.474405  0.067893
5 -0.613102 -0.185065 -0.984693
6  2.037839  0.019079  0.752051

In [25]:
# Preencha os valores NA com o método ffill 
df.fillna(method='ffill')

### Remover duplicatas

In [45]:
# Considere o seguinte dataframe
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'], 'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [26]:
# Mostre quais desses itens são duplicados

In [27]:
# Remova os itens duplicados

### Indexação Hierárquica

#### Possibilita mais de um nível de indexação num eixo

In [50]:
# Considere a seguinte Serie
data = pd.Series(np.random.randn(9), index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                                            [1, 2, 3, 1, 3, 1, 2, 2, 3]])
# Mostre o indice hierárquico
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [28]:
# Faça um filtro com uma lista

In [29]:
# Faça um filtro no 2o Nível (mais interno)

In [19]:
# Considere o seguinte dataframe
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                     index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                     columns=[['Ohio', 'Ohio', 'Colorado'],['Green', 'Red', 'Green']])
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [30]:
# Resumo estatístico por nível
# Extraia a soma da agregação do nível 2 (mais interno)

### merge (fundir/juntar)
#### A chave de junção (identificador único) foi inferida a partir do contexto (procurando nas colunas)
#### Também pode ser especificada com o argumento on (Ex.: on='key')

In [57]:
# Considere os seguintes DataFrames
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'], 'data1': range(7)})
df2 = pd.DataFrame({'key': ['a', 'b', 'd'], 'data2': range(3)})

In [59]:
# Mostre o dataframe df1
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [60]:
# Mostre o dataframe df2
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [31]:
# Faça o merge dos dois dataframes usando como chave de junção a coluna 'key'


# Por que chamamos esse tipo de merge/join de inner ? R.: Porque ele considera apenas a 
#     intersecção dos dois conjuntos de chaves.
# O argumento how='inner' é o padrão.

In [32]:
# Faça também o merge com o argumento how='outer'

### join (fundir/juntar)
#### Semelhante ao merge, mas a chave de junção é o índice do DataFrame

In [22]:
# Considere os seguintes DataFrames
left2 = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]], index=['a', 'c', 'e'], 
                     columns=['Ohio', 'Nevada'])
right2 = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]],index=['b', 'c', 'd', 'e'],
                     columns=['Missouri', 'Alabama'])

In [23]:
# Mostre o dataframe left2
left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [24]:
# Mostre o dataframe right2
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [33]:
# Faça o join entre os dois DataFrames sem descartar registros que não estejam 
#      nos dois DataFrames

In [34]:
# Considerando os dataframes left2 e right2 definidos acima
# Faça o join entre os dois DataFrames sem descartar registros que estejam 
# apenas no dataframe left2, e descartando registros que estejam apenas no right2

### Reshaping / Pivoting (Pivotar)

In [73]:
# Considere o seguinte DataFrame
table = {
    'Aluno': ['AlunoA', 'AlunoA', 'AlunoA', 'AlunoA', 'AlunoB', 'AlunoB', 'AlunoB', 'AlunoB'],
    'Disciplina': ['Portugues', 'Matematica', 'Geografia', 'História', 'Portugues', 'Matematica', 'Geografia', 'História'],
    'Objetiva': [8.5, 7.5, 9, 10, 8.5, 7.5, 9, 10],
    'Discursiva': [6, 6.5, 7.5, 7, 8.5, 7.5, 9, 10]}
df_provas = pd.DataFrame(table)
df_provas

    Aluno  Disciplina  Objetiva  Discursiva
0  AlunoA   Portugues       8.5         6.0
1  AlunoA  Matematica       7.5         6.5
2  AlunoA   Geografia       9.0         7.5
3  AlunoA    História      10.0         7.0
4  AlunoB   Portugues       8.5         8.5
5  AlunoB  Matematica       7.5         7.5
6  AlunoB   Geografia       9.0         9.0
7  AlunoB    História      10.0        10.0

In [35]:
# Pivote o dataframe df_provas colocando a coluna Aluno como índice, 
# os valores da coluna Disciplina como colunas, e os valores da coluna Objetiva
# como conteúdo do novo dataframe

### E quando houver valores repetidos ?
#### Pivotar com o mesmo método pivot() gera exceção. Neste caso, use o método pivot_table 
#### mean é a métrica padrão de cálculo sobre a de agregação

In [76]:
# Considere o seguinte DataFrame
table2 = {
    'Aluno': ['AlunoA', 'AlunoA', 'AlunoA', 'AlunoA', 'AlunoA', 'AlunoB', 'AlunoB', 'AlunoB', 'AlunoB'],
    'Disciplina': ['Portugues', 'Matematica', 'Geografia', 'Geografia', 'História', 'Portugues', 'Matematica', 'Geografia', 'História'],
    'Objetiva': [8.5, 7.5, 9, 10, 9, 8.5, 7.5, 9, 10],
    'Discursiva': [6, 6.5, 7.5, 7, 8, 8.5, 7.5, 9, 10]}
df_provas2 = pd.DataFrame(table2)
df_provas2

    Aluno  Disciplina  Objetiva  Discursiva
0  AlunoA   Portugues       8.5         6.0
1  AlunoA  Matematica       7.5         6.5
2  AlunoA   Geografia       9.0         7.5
3  AlunoA   Geografia      10.0         7.0
4  AlunoA    História       9.0         8.0
5  AlunoB   Portugues       8.5         8.5
6  AlunoB  Matematica       7.5         7.5
7  AlunoB   Geografia       9.0         9.0
8  AlunoB    História      10.0        10.0

In [36]:
# Pivotar com o mesmo comando gera uma exceção
# df_pivoted2 = df_provas2.pivot(index='Aluno', columns='Disciplina', values='Objetiva')
# Use a funcao pivot_table. O valor padrão do argumento aggfunc é 'mean'

### Reshaping / Pivoting com Índice Hierárquico
#### Método stack/unstack (Pivotar com índice hierárquico)

In [83]:
# Considere o seguinte dataframe
data = pd.DataFrame(np.arange(6).reshape((2, 3)),
                    index=pd.Index(['Ohio', 'Colorado'], name='state'),
                    columns=pd.Index(['one', 'two', 'three'],
                    name='number'))
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [37]:
# Faça uma operação de unpivoting (stack) com o dataframe data e guarde na variavel result

In [38]:
# Faça uma operação de pivoting (unstack) com o dataframe result